package com.ydy._23字符集;

/**
    目标：字符键/编码集

    字符键：各个国家为自己国家的字符取的一套编号规则。
    计算机的底层是不能直接存储字符的。
    计算机的底层只能存储二进制。010101
    二进制就是可以转换成10进制的，10进制就是整数编号。
    结论：
        计算机的底层可以存储编号。

    101=1*2^0+0*2^1+1*2^2=5

    美国人：
        8个开关一组就可以编码字符。1个字节。
        2^8=256
        一个字节存储一个字符完全就够用了。

        a 97
        b 98
        c 99

        A 65
        B 66

    小结：
        英文和数字在任何编码集中都是一样的，都占1个字节。
        GBK编码中，1个中文字符一般占2个字节。
        UTF-8编码中，1个中文字符一般占3个字节。
        技术人员都应该使用UTF-8编码！
 */
public class CharsetDemo {
}
